Tekla.Structures.ModelInternal.dotRebarStrip_t
Struct for the BaseRebarModifier.

Tekla.Structures.ModelInternal.dotRebarStrip_t.ModelObject
The model object.

Tekla.Structures.ModelInternal.dotRebarStrip_t.FatherId
The father ID.

Tekla.Structures.ModelInternal.dotRebarStrip_t.Curve
The curve.

Tekla.Structures.ModelInternal.dotRebarStrip_t.BarsAffected
The bars affected.

Tekla.Structures.ModelInternal.dotRebarStrip_t.FirstAffectedBar
The first affected bar.

Tekla.Structures.ModelInternal.dotRebarStrip_t.FollowEdges
The follow edges flag.

Tekla.Structures.ModelInternal.dotRebarStrip_t.ApplyOrderNumber
The apply order number.

Tekla.Structures.ModelInternal.dotRebarStrip_t.Flags
The set/unset flags.